# -*- coding: utf-8 -*-
import scrapy,requests,json,urllib


from com.baizhi.hl.中国商标网.shangbiao.shangbiao.items import ShangbiaoItem
from urllib import parse
import re
kw_temp = """

Z开头的：尊、宗、滋、卓、竹、洲、众、中、至、芝、珍、正、真、者、朝、泽、左、钻、醉、祖、族、自、恣、紫、壮、专、主、周、舟、重、忠、智、致、志、直、知、支、之、朕、震、振、贞、哲、照、召、长、璋、则、早、赞（共50个字）。

Y开头的：韵、运、月、乐、跃、悦、愿、苑、缘、圆、园、源、元、渊、御、誉、玉、宇、友、有、悠、勇、永、颖、影、盈、赢、莹、莺、英、鹰、银、茵、殷、因、翼、音、艺、逸、义、易、亦、奕、益、意、一、乙、亿、仪、怡、伊、宜、颐、壹、依、叶、也、养、扬、阳、洋、岩、研、言、亚、雅、丫（共67个字）。

X开头的：迅、逊、旬、雪、学、旋、炫、绚、轩、煦、许、秀、修、雄、性、兴、幸、行、星、信、新、欣、鑫、心、协、谐、笑、孝、肖、晓、逍、向、相、项、乡、详、祥、翔、享、香、羡、贤、弦、纤、鲜、仙、夏、霞、侠、玺、禧、喜、习、夕、悉、息、希、茜、昔、熙、溪、馨（共62个字）

W开头的：雾、午、舞、五、妩、吴、武、吾、无、我、沃、翁、问、吻、稳、雯、文、卫、味、为、未、玮、伟、纬、唯、维、薇、威、旺、王、望、网、万、婉、娩（共35个字）


"""
a='''
T开头的：驼、妥、拓、土、途、图、同、统、铜、彤、童、通、婷、亭、铁、恬、田、甜、天、腾、特、淘、涛、堂、唐、昙、谈、太、泰、台、它、他、她（共51个字）

S开头的：所、锁、索、遂、岁、穗、夙、素、苏、宋、颂、松、四、丝、司、思、数、顺、舜、水、爽、双、帅、率、术、束、庶、树、蜀、署、熟、舒、书、寿、首、守、适、释、誓、世、时、仕、市、始、史、石、什、十、实、施、胜、圣、盛、晟、升、生、甚、审、神、参、申、舍、少、尚、上、记、善、闪、姗、山、杉、色、森、桑、三、赛（共76个字）

R开头的：若、锐、瑞、睿、润、闰、如、儒、柔、容、荣、融、日、任、忍、仁、人、冉、然（共19个字）

Q开头的：群、雀、确、泉、全、权、曲、屈、趋、酋、龟、琼、秋、穹、晴、情、清、青、勤、秦、亲、且、俏、巧、乔、强、茜、纤、千、谦、卡、恰、起、企、启、骑、祈、琪、其、齐、七、戚、栖（共43个字）

P开头的：普、朴、魄、繁、萍、平、屏、品、漂、皮、朋、佩、攀、番、派（共15个字）

O开头的：欧、讴、偶 （共3个字）

N开头的：诺、娜、奴、努、侬、农、纽、牛、宁、妞、凝、念、年、匿、昵、霓、妮、尼、能、内、瑙、楠、难、南、男、奈、耐、乃、纳、拿（共30个字）

M开头的：穆、睦、沐、牧、目、木、牡、谋、默、墨、漠、莫、陌、茉、摩、命、铭、明、鸣、名、敏、妙、渺、苗、密、靡、米、弥、眯、梦、蒙、萌、魅、媚、妹、美、梅、媒、枚、玫、茂、曼、迈、麦、玛（共45个字）

L开头的：络、珞、罗、伦、栾、绿、委、露、璐、鹿、陆、录、六、卢、隆、龙、柳、琉、令、零、翎、聆、玲、灵、琳、林、列、燎、了、廖、辽、靓、亮、梁、良、恋、联、莲、怜、连、粒、荔、莉、俪、利、丽、立、力、历、里、礼、黎、厘、磊、蕾、乐、劳、浪、朗、郎、琅、蓝、兰、赖、莱、拉（共66个字）

K开头的：昆、魁、奎、匡、宽、快、酷、库、苦、蔻、口、空、肯、客、克、可、轲、科、珂、柯、康、楷、铠、凯、开、卡、咖（共27个字）

J开头的：骏、珺、俊、菌、钧、君、军、绢、眷、娟、聚、具、橘、菊、居、久、玖、炯、静、靖、敬、婧、竟、竞、净、劲、憬、景、井、鲸、精、兢、晶、菁、荆、经、京、晋、瑾、谨、锦、津、矜、金、今、家、解、界、介、捷、杰、节、阶、皎、娇、姣、将、奖、江、箭、鉴、舰、健、剑、建、简、兼、坚、甲、嘉、家、佳、茄、伽、加、冀、寂、季、际、系、纪、济、几、籍、集、吉、激、基、姬、积 (共90个字)

H开头的：惑、获、或、伙、火、活、和、豁、慧、汇、卉、回、徽、辉、凰、黄、皇、焕、宦、幻、环、欢、怀、话、画、华、化、花、虎、胡、乎、候、厚、后、鸿、洪、宏、红、弘、烘、衡、恒、黑、鹤、荷、贺、和、何、合、禾、皓、颢、浩、昊、好、豪、号、行、翰、悍、汉、韩、寒、涵、含、海、哈（共67个字）

G开头的：果、国、桂、贵、硅、闺、龟、归、广、光、冠、贯、观、管、馆、官、庆、乖、瓜、顾、固、贾、谷、股、古、姑、估、贡、共、巩、恭、宫、攻、公、弓、工、庚、更、各、个、革、歌、格、戈、高、港、钢、感、甘、盖、改（共51个字）

F开头的：馥、富、复、阜、付、府、福、甫、符、孚、夫、弗、奉、凤、逢、峰、枫、风、丰、奋、分、芬、翡、菲、霏、妃、飞、芳、方、范、泛、繁、樊、凡、番、发、法（共55个字）

E开头的：二、迩、尔、而、儿、恩、婀（共7个字）

D开头的：朵、夺、度、多、顿、盾、敦、对、队、段、端、渡、杜、独、都、督、豆、斗、动、懂、冬、定、鼎、顶、丁、调、雕、殿、甸、电、点、典、蒂、帝、谛、第、娣、地、邸、笛、迪、狄、的、滴、得、德、道、到、岛、荡、当、蛋、淡、旦、单、丹、戴、黛、代、大、妲、答、达（共63个字）

C开头的：寸、存、翠、村、脆、丛、匆、次、此、慈、辞、兹、绰、醇、淳、纯、春、窗、创、串、传、川、楚、储、处、初、出、丑、臭、愁、绸、宠、崇、重、憧、虫、翅、赤、尺、驰、痴、骋、橙、乘、城、承、诚、呈、丞、成、称、晨、陈、沉、辰、尘、臣、琛、澈、炒、潮、朝、超、畅、敞、场、常、尝、长、昌、阐、产、潺、馋、婵、柴、差、钗、察、查、曾、岑、策、测、册、草、曹、苍、仓、惭、残、采、参、彩、财、才（共96个字）

B开头的：部、步、布、不、堡、补、博、泊、帛、驳、伯、播、玻、并、禀、炳、秉、丙、兵、冰、缤、斌、彬、宾、别、璧、碧、毕、必、彼、比、本、奔、蓓、倍、备、贝、北、报、保、宝、邦、伴、半、般、班、拜、百、白、霸、罢、吧、巴、八（共54个字）

A开头的：澳、奥、傲、翱、凹、昂、岸、安、爱、艾、霭、蔼、阿
'''
KW_LIST = re.findall('(.)、',kw_temp)


def get_obj(pn,kw,year=None):
    year=year or ''
    return {"pageNo":pn,
            "pageSize":20,
            "keyword":kw,
            "searchType":1,
            "orderWay":0,
            "searchFieldDTO":
                {
                    "trademarkName":1,
                    "trademarkNumber":"",
                    "applicationNameAndGyr":"",
                    "agency":"",
                    "typeOfTrademarkId":"",
                    "yearOfApplication":'{}'.format(year),
                    "legalStatusId":""
                }
            }

def all_obj():
    for kw in KW_LIST:
        for pn in range(1,500+1):
            # for year in range(2000,2020):
            yield get_obj(pn=pn,kw=kw)

ALL_OBJ = all_obj()




class Shangbiao33Spider(scrapy.Spider):
    name = 'shangbiao33'
    allowed_domains = ['https://www.qmxip.com/']
    start_urls = ['https://www.qmxip.com/']
    headers={
        'Referer':'https://www.qmxip.com/tm/0_%E7%A0%96',
        'User-Agent':'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.100 Safari/537.36',
        'Accept':'application/json, text/plain, */*',
        'Content-Type':'application/json;charset=UTF-8',
        'Origin':'https://www.qmxip.com',
    }


    def parse(self, response):
        url='https://gw.qmxip.com/api-e/trademark/query_hit_page'
        for i in ALL_OBJ:
            yield scrapy.Request(url=url,callback=self.parseList,headers=self.headers,body=json.dumps(i),dont_filter=True)

    def parseList(self,response):
        try:
            # print('*****************************************************************************')
            result_url=json.loads(response.text)['data']['list']
            for i in result_url:
                items=ShangbiaoItem(
                    name=i['trademarkName'],
                    num=i['trademarkNumber'],
                )
                yield items
        except:
            pass

















